# CreatePullDownMenu

## Description
Creates a new pulldown menu control in a dialog layout.

```pascal
PROCEDURE CreatePullDownMenu(
				dialogID          : LONGINT;
				itemID            : LONGINT;
				widthInCharacters : LONGINT);
```

```python
def vs.CreatePullDownMenu(dialogID, itemID, widthInCharacters):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog layout containing the control.|
|itemID|LONGINT|The index that will identify the control item.|
|widthInCharacters|LONGINT|The width of the control in characters.|

## Examples
alogLayoutPulldownMenu}}

## Version
Availability: from VectorWorks9.0

## Category
* Dialogs - Modern